{
    "name": "content",
    "doc_namespace": "doc",
    "doc_class": "doc",
    "references": [
        "doc.index"
    ],
    "data": {
        "body": "[title Content]\n\nWe've seen how you can generate content by rendering templates in [doc urls]. It is entirely possible to build a web application using templates alone -- which is how most web frameworks work. The downside of templates is that they can become difficult to maintain as the project grows. Making a seemingly simple change tends to involve editing a number of files, and increases the chance that you will break something on some other page. Moya offers a complimentary system called [i]content[/i] that makes generating HTML in a web application a less [i]brittle[/i] process.\n\nConsider some kind of corporate site, which is the bread and butter for many developers. Your client has asked you to put a news ticker widget on the front page, which pulls news items items from the database. You implement this by adding some parameters to the template which generates the page, and including a  template to generate the widget markup. You also add markup on the main page to pull in the CSS and Javascript that makes it work. Your client is happy for a few weeks, but comes back to request that you show a news ticker on [i]another[/i] page, with news from a different source. So you modify the view for the new page to generate the appropriate parameters, and modify the other template to include the widget markup, JS, and CSS. Even if you were to factor out common elements and follow best-practices, you've still done work twice. And the problem only gets worse if your client wants yet another new ticker elsewhere.\n\nThis is one of issues that Moya's content system is intended to solve. With content, you can implement the news ticker with the usual web development technologies. Only now you can add a news ticker to another page with a [i]single[/i] line change that automatically generates the markup and pulls in the JS and CSS needed to make it just work. Leaving you plenty of time to invoice the client and go back to playing Minecraft.\n\n[h1]Defining Content[/h1]\n\nA content definition is a high level description of a page which Moya will use to generate markup. Content consists of a number of independent [i]sections[/i] containing nested elements.\n\nLets look at an example of a content definition. The following might be used to render an index page, which lists all available sushi products:\n\n[code xml]\n<moya>\n    <content libname=\"content.product.list\" template=\"product-list.html\">\n        <title>Sushi Product Page</title>\n        <section name=\"body\">\n            <for src=\"products\" dst=\"product\">\n                <node template=\"product.html\" let:product=\"product\"/>\n            </for>\n        </section>\n    </content>\n</moya>\n[/code]\n\nThe following code will render the content:\n\n[code xml]\n<render-content content=\"#content.product.list\" dst=\"html\">\n    <let products=\"['nigiri', tuna-roll', 'fugu']\"/>\n</render-content>\n[/code]\n\nThe code inside [tag]content[/tag] is executable Moya code; when invoked (with [tag]render-content[/tag]) Moya will execute the content line by line and build up an internal description of the page, known as a [i]content object[/i]. This content object may then be rendered with a template to create the HTML that will be served.\n\n[aside]You can watch the content being create in the debugger by displaying the value of [b].content[/b][/aside]\n\nThe first tag inside the [tag]content[/tag] tag is [tag]title[/tag], which sets the title to [c]\"Sushi Product Page\"[/c]. Next there is a [tag]section[/tag] tag which marks a block of [i]renderable[/i] elements. A section defines content for a particular part of a page; such as the body, a column, footer, etc. In our example we have a single section called [c]body[/c] which contains a [tag]for[/tag] loop that calls [tag]node[/tag] for each item in the [c]products[/c] list. The [tag]node[/tag] tag associates data with a template, so the content will contain a reference to a template for each item in [c]products[/c].\n\nWhen the [tag]content[/tag] tag returns, Moya now has a content object that contains information about all the elements in the page; typically references to templates and associated data. Moya can then render this data structure with the template specified in the [c]template[/c] attribute of [tag]content[/tag].\n\nLets look at the [c]product-list.html[/c] template which renders the content:\n\n[code moyatemplate]\n<html>\n    <head>\n        <title>${title}</title>\n    </head>\n    <body>\n        {% render sections.body %}\n    </body>\n</html>\n[/code]\n\nThis template inserts the title of the content (set by the [tag]title[/tag] tag), and renders the [c]body[/c] section from the content.\n\nThe [tag]title[/tag] tag is actually a shortcut, equivalent to the following:\n\n[code xml]\n<str dst=\"title\">Sushi Product Page</str>\n[/code]\n\nThis works because any data created in the content scope is passed to the template. Moya also passes a dictionary called [c]sections[/c] to the template which contains the renderable elements defined in the sections.\n\nWhen Moya sees [link templates#render]{% render sections.body %}[/link] in the main template, it renders the [c]body[/c] section, which contains three template nodes; one for each product. The template nodes render the following template ([c]product.html[/c]):\n\n[code moyatemplate]\n<div class=\"product\">\n    <a href=\"{% url 'product' with product=product %}\">Buy ${title:product}</a>\n</div>\n[/code]\n\nThe end product will be a string contain HTML, which would look something like the following:\n\n[code moyatemplate]\n<html>\n    <head>\n        <title>Sushi Product Page</title>\n    </head>\n    <body>\n        <div class=\"product\">\n            <a href=\"/sushifinder/product/nigiri/\">Nigiri</a>\n        </div>\n        <div class=\"product\">\n            <a href=\"/sushifinder/product/tuna-roll/\">Tuna-rooll</a>\n        </div>\n        <div class=\"product\">\n            <a href=\"/sushifinder/product/fugu/\">Fugu</a>\n        </div>\n    </body>\n</html>\n[/code]\n\nIn a real project, the content definition would have more sections and different types of renderable elements. But as requirements grow more complex, the code inside the [tag]content[/tag] stays relatively manageable. Operations such as modifying template parameters, and moving markup from one content area to another are trivially simple, in contrast to a pure template approach.\n\n[alert NOTE]The HTML code shown here is aligned for sake of readability, but may not match the actual rendered code (although the end result will be the same).[/alert]\n\n[h1]Rendering Content[/h1]\n\nThe [tag]render-content[/tag] tag is one way of rendering content. It renders content to a string, which you could then return from a view. Because you rarely want to do any more processing once you have a page of HTML, Moya also offers the [tag]serve-content[/tag] tag which renders and serves content in one.\n\nHere's how the previous example could be written to serve the content immediately:\n\n[code xml]\n<serve-content content=\"#content.product.list\">\n    <let products=\"['nigiri', tuna-roll', 'fugu']\"/>\n</serve-content>\n[/code]\n\nYou can also specify the content to render from the [c]content[/c] attribute of the [tag]view[/tag] tag. The following view renders content with the value for [c]products[/c] created in the view scope:\n\n[code xml]\n<view libname=\"view.products\" content=\"#content.product.list\">\n    <let products=\"['nigiri', tuna-roll', 'fugu']\"/>\n</view>\n[/code]\n\nServing views with content in this way follows the same logic regarding returned data as [link urls#template-views]template views[/link]; the following is also valid:\n\n[code xml]\n<view libname=\"view.products\" content=\"#content.product.list\">\n    <return-dict let:products=\"['nigiri', tuna-roll', 'fugu']\" />\n</view>\n[/code]\n\n[h1]Nested Content[/h1]\n\nContent tags may contain other content tags. In fact, it is very common to have several levels of nested content in a typical page. Lets take the preceding example and demonstrate how to render nested content. We are going to move the products [i]inside[/i] a template node which will wrap it with some HTML markup.\n\nFor sake of demonstration, we will wrap the list of products in an HTML [c]<div>[/c] tag with a class of [c]product-container[/c]. Here's the new content:\n\n[code xml]\n<moya>\n    <content libname=\"content.product.list\" template=\"product-list.html\">\n        <title>Sushi Product Page</title>\n        <section name=\"body\">\n            <node template=\"product-container.html\">\n                <for src=\"products\" dst=\"product\">\n                    <node template=\"product.html\" let:product=\"product\"/>\n                </for>\n            </node>\n        </section>\n    </content>\n</moya>\n[/code]\n\nThe product nodes are now rendered inside another node with a template of [c]product-container.html[/c]. This template has the additional responsibility of rendering its [i]children[/i] as well. Rendering children can be done with the [link templates#children]{% children %}[/link] template tag. Here is the [c]product-container.html[/c] template:\n\n[code moyatemplate]\n<div class=\"product-container\">\n{% children %}\n</div>\n[/code]\n\nNow, when we render the content we will get the following:\n\n[code moyatemplate]\n<html>\n    <head>\n        <title>Sushi Product Page</title>\n    </head>\n    <body>\n        <div class=\"product-container\">\n            <div class=\"product\">\n                <a href=\"/sushifinder/product/nigiri/\">Nigiri</a>\n            </div>\n            <div class=\"product\">\n                <a href=\"/sushifinder/product/tuna-roll/\">Tuna-rooll</a>\n            </div>\n            <div class=\"product\">\n                <a href=\"/sushifinder/product/fugu/\">Fugu</a>\n            </div>\n        </div>\n    </body>\n</html>\n[/code]\n\n[h2]Advanced Nesting[/h2]\n\nOccasionally it is useful to have more control over how sections are rendered. If a section is empty (or does not exist) it will evaluate to [c]False[/c]. You can use this in a template to render a section only if it has content. For example, here's how we would modify [c]product-list.html[/c] to only render the body section if it is non-empty:\n\n[code moyatemplate]\n<html>\n    <head>\n        <title>${title}</title>\n    </head>\n    <body>\n        {%- if sections.body %}\n        {% render sections.body %}\n        {%- endif %}\n    </body>\n</html>\n[/code]\n\nYou may also iterate over the [i]children[/i] in a content section and render them individually. You might want to do this if you want to wrap each child in markup. For example, lets take the [c]product-container.html[/c] template and modify it so we wrap each product individually, rather than all of them:\n\n[code moyatemplate]\n<!-- product-container.html -->\n{% for child in self %}\n<div class=\"product-container\">\n    {% render child %}\n</div>\n{% endfor %}\n[/code]\n\nThe above template iterates over a value called [c]self[/c] which is the current content object being rendered (in this case it is the [tag]node[/tag] with [c]template=\"product-container.html\"[/c]). The [link templates#render]{% render %}[/link] template tag renders each of the child nodes inside a [c]<div>[/c]. This change would result in the following output:\n\n[code moyatemplate]\n<html>\n    <head>\n        <title>Sushi Product Page</title>\n    </head>\n    <body>\n        <div class=\"product-container\">\n            <div class=\"product\">\n                <a href=\"/sushifinder/product/nigiri/\">Nigiri</a>\n            </div>\n        </div>\n        <div class=\"product-container\">\n            <div class=\"product\">\n                <a href=\"/sushifinder/product/tuna-roll/\">Tuna-rooll</a>\n            </div>\n        </div>\n        <div class=\"product-container\">\n            <div class=\"product\">\n                <a href=\"/sushifinder/product/fugu/\">Fugu</a>\n            </div>\n        </div>\n    </body>\n</html>\n[/code]\n\n[h1]Content HTML tags[/h1]\n\nTags in a content definition are typically [i]high-level[/i]; they specify [i]what[/i] to render, and leave the [i]how[/i] to a template. Occasionally though, it is useful to be able to specify the markup directly in the content. For instance, if you want to wrap content in a simple [c]<div>[/c] and creating a another template seems overkill.\n\nTo insert simple HTML content you can use the [c]http://moyaproject.com/html[/c] namespace. Any tag in that namespace will result in the equivalent tag in the rendered output. For example, lets take our list of sushi products and wrap them in a [c]<div>[/c] with a class of [c]products-column[/c]. Here's how we could do that:\n\n[code xml]\n<moya xmlns:html=\"http://moyaproject.com/html\">\n    <content libname=\"content.product.list\" template=\"product-list.html\">\n        <title>Sushi Product Page</title>\n        <section name=\"body\">\n            <html:div class=\"products-column\">\n                <node template=\"product-container.html\">\n                    <for src=\"products\" dst=\"product\">\n                        <node template=\"product.html\" let:product=\"product\"/>\n                    </for>\n                </node>\n            </html:div>\n        </section>\n    </content>\n</moya>\n[/code]\n\nNote the addition of [c]xmlns:html=\"http://moyaproject.com/html\"[/c] to the root tag which introduces the html [link xml#namespaces]namespace[/link], and the [c]html:[/c] prefix on the [c]<html:div>[/c] tag. When this content is rendered, it will product the following output:\n\n[code moyatemplate]\n<html>\n    <head>\n        <title>Sushi Product Page</title>\n    </head>\n    <body>\n        <div class=\"products-columm\">\n            <div class=\"product-container\">\n                <div class=\"product\">\n                    <a href=\"/sushifinder/product/nigiri/\">Nigiri</a>\n                </div>\n            </div>\n            <div class=\"product-container\">\n                <div class=\"product\">\n                    <a href=\"/sushifinder/product/tuna-roll/\">Tuna-rooll</a>\n                </div>\n            </div>\n            <div class=\"product-container\">\n                <div class=\"product\">\n                    <a href=\"/sushifinder/product/fugu/\">Fugu</a>\n                </div>\n            </div>\n        </div>\n    </body>\n</html>\n[/code]\n\n[h1]Extending Content[/h1]\n\nA content definition may [i]extend[/i] another, in much the same way as [link templates]templates[/link] may be extended. When content is extended it inherits any data from the extended content, and sections with the same name are combined. The result may be rendered as normal.\n\nExtending content is most often done when when there are common elements in a page and you don't want to repeat yourself. Lets write a content element for the sushi example that will display special offers on every page in the project. This content element will define a section named [c]body[/c] with a single [tag]node[/tag] that renders [c]specials.html[/c].\n\n[code xml]\n<moya>\n    <content libname=\"content.base\">\n        <section name=\"body\" merge=\"append\">\n            <node template=\"specials.html\"/>\n        </section>\n    </content>\n</moya>\n[/code]\n\nTo extend from this content, we need only add an [c]extends[/c] attribute which contains an [link moyacode#element-references]element reference[/link] to the [c]base[/c] content. Here's how we would change the [tag]content[/tag] tag to extend the base template, above:\n\n[code xml]\n<content libname=\"content.product.list\" template=\"product-list.html\" extends=\"#content.base\">\n    <!-- as previous content example -->\n</content>\n[/code]\n\nIf we were to render the product list content now, the template [c]specials.html[/c] will be inserted immediately prior to the three products. As will any content that extends from [c]#content.base[/c].\n\nYou may have noticed the [c]merge[/c] attribute on the [tag]section[/tag] in the base content. This tells Moya what do if a similarly-named section exists in both content definitions. This attribute may be set to one of the following three values:\n\n[definitions]\n[define replace]Replaces the content from the base section entirely (the default).[/define]\n[define append]Appends new content to the similarly-named section being extended -- which generally results in the markup appearing below the base content markup.[/define]\n[define prepend]Prepends new content to the similarly-named section being extended.[/define]\n[/definitions]\n\nContent may be extended multiple times, just be careful not to extend the same content definition multiple times in a chain, which would result in an error.\n\nIf the [c]extends[/c] attribute is [i]not[/i] specified, then Moya will extend from the content specified in the [link project#site-section]base_content[/link] setting in the [c][site][/c] section of your project settings. This is a good way of customizing the look and feel on a per-site basis.\n\n[h1]Widgets[/h1]\n\nA [i]widget[/i] is a form of [link customtags]custom tag[/link] which generates content. At a simple level, a widget may take the place of a [tag]node[/tag] in that it can render a template with data. Widgets may also run executable Moya code and pull in external files such as JS and CSS. This makes widgets very self-contained, in that you can move a widget tag from one page to another and the page will render correctly without any further changes to markup, stylesheets or Javascript.\n\nLet's show how we could use custom widgets in place of node tags in the sushi examples. The following code defines a widget called [c]<product>[/c]:\n\n[code xml]\n<widget name=\"product\" template=\"widgets/product.html\">\n    <signature>\n        <attribute name=\"product\" type=\"expression\" required=\"yes\"/>\n    </signature>\n</widget>\n[/code]\n\nThis widget may now be used in place of the the equivalent [tag]node[/tag]. The [c]template[/c] attribute of [tag]widget[/tag] defines the template to use. By convention, widget templates are placed in a subdirectory called [c]widgets[/c] (within the library's template directory). The template itself is the same as the template used previously. Here it is again:\n\n[code moyatemplate]\n<!-- widgets/product.html -->\n<div class=\"product\">\n    <a href=\"{% url 'product' with product=product %}\">Buy ${title:product}</a>\n</div>\n[/code]\n\nAnd here is how you would use it in a content definition:\n\n[code xml]\n<moya xmlns:sushi=\"http://moyaproject.com/sushifinder\">\n    <content libname=\"content.product.list\" template=\"product-list.html\">\n        <title>Sushi Product Page</title>\n        <section name=\"body\">\n            <node template=\"product-container.html\">\n                <for src=\"products\" dst=\"product\">\n                    <sushi:product product=\"product\" />\n                </for>\n            </node>\n        </section>\n    </content>\n</moya>\n[/code]\n\nNote the addition of the [url xml#namespaces]namespace[/url] declaration in the first tag. The namespace URL should be the value used in the library's [link library#lib-section]lib.ini[/link] file. The inner-most [tag]node[/tag] has been replaced with the widget tag.\n\n[h2]Adding CSS to a widget[/h2]\n\nUsing a widget tag here has made the content definition marginally more readable, but we haven't gained much for this example. In a real-life example though, a widget will probably have at least some CSS associated with it. Let's add some CSS to the product widget. The following will create a CSS style that draws a red border around each prouduct:\n\n[aside]Red borders are ugly, this is just for demonstration purposes.[/aside]\n\n[code xml]\n<widget name=\"product\" template=\"widgets/product.html\">\n    <signature>\n        <attribute name=\"product\" type=\"expression\" required=\"yes\"/>\n    </signature>\n    <css>\n    .content\n    {\n    border: 1px solid red;\n    }\n    </css>\n</widget>\n[/code]\n\nWhen you render the content definition now, the product widget will add the CSS to the a section in the content called [c]\"css\"[/c]. To ensure that the css is added to our page, we need to render the [c]css[/c] block in the base template. Here's how we would do that:\n\n[code moyatemplate]\n<html>\n    <head>\n        {% render sections.css unique %}\n        <title>${title}</title>\n    </head>\n    <body>\n        {% render sections.body %}\n    </body>\n</html>\n[/code]\n\nNow when you render the content, the following code will be added inside the [c]<head>[/c] markup:\n\n[code moyatemplate]\n<style type=\"text/css\">\n.content\n{\nborder: 1px solid red;\n}\n</style>\n[/code]\n\nNote the addition of the keyword [c]unique[/c] in the template tag which renders the [c]css[/c] section. This tells Moya not to render identical content more than once. This is so that if we have ten [c]<product>[/c] tags on a page, we only get a single copy of the style tag.\n\nWhile it is possible to write CSS in widgets like this, it is generally preferable to link to an external stylesheet, so that you can keep your code modular. To reference an external CSS files use the [tag]include-css[/tag] tag, which takes the path to a CSS file in the [c]path[/c] attribute. For example, we can save the following CSS as [c]css/widgets/products.css[/c] in the library's [link library#media-section]media[/link] directory:\n\n[code html]\n/* css/widgets/product.css */\n.content\n{\nborder: 1px solid red;\n}\n[/code]\n\nThe widget definition would become:\n\n[code xml]\n<widget name=\"product\" template=\"widgets/product.html\">\n    <signature>\n        <attribute name=\"product\" type=\"expression\" required=\"yes\"/>\n    </signature>\n    <include-css path=\"css/widgets/product.css\" />\n</widget>\n[/code]\n\nThe [tag]include-css[/tag] tag adds a dictionary to the content called [c]include[/c] which will contain a list of CSS paths called [c]css[/c]. Here's how you can render the included CSS paths in the base template:\n\n[code moyatemplate]\n<html>\n    <head>\n        {% render include.css %}\n        <title>${title}</title>\n    </head>\n    <body>\n        {% render sections.body %}\n    </body>\n</html>\n[/code]\n\nMoya won't add a CSS path to the list more than once, so the [c]unique[/c] keyword is not required here.\n\n[h2]Adding Javascript to a Widget[/h2]\n\nAssociating javascript with a widget is very similar to [link content#adding-css-to-a-widget]adding CSS[/link]; the [tag]js[/tag] tag adds Javascript to the [c]js[/c] section, and [tag]include-js[/tag] references a JS file in the library's media directory.\n\nAs with CSS, it is generally better to write external Javascript files and include them with [tag]include-js[/tag]. An exception would be if the main functionality is in an external file but you also want a short snippet of code to initialize an individual widget. To demonstrate one way of doing this, we will look at some code from the Moya Comments library.\n\nThe comments widget renders the comments HTML and also invokes some JS. The widget includes the following line:\n\n[code xml]\n<include-js path=\"js/comments.js\" />\n[/code]\n\nThis ensures that a script tag will be generated in the page to load [c]comments.js[/c], which contains a [url http://jquery.com/]JQuery[/url] plugin:\n\nAlso in the widget is the following code:\n\n[code moyatemplate]\n<let id=\".content.id\" />\n<js>\n    $(function(){\n        $('#${id}').moyaComments();\n    });\n</js>\n[/code]\n\nThe first line sets [c]id[/c] to the value of [c].content.id[/c] which is updated every time a content tag adds some content -- making it an effective unique ID for the current page. The [tag]js[/tag] tag generates a short script that invokes the JQuery plugin for the comments widget being rendered.\n\nThe comments template starts with the following line:\n\n[code moyatemplate]\n<div class=\"moya-comments-container\" id=\"${id}\">\n[/code]\n\nNote the reference to [c]id[/c], which is set to the same value that was used in the [tag]js[/tag]. This connects the JQuery widget to the markup it applies to.\n\n[h1]Common Sections[/h1]\n\nWe've seen how adding a widget to a content definition requires that associated objects such as JS / CSS must be rendered in the base template. If we want to ensure that a widget renders equally well with different templates -- even when added by third parties -- we need to add a few common sections and render calls to our base templates.\n\nHere's an example of a bear-bones HTML 5 base template with all common sections:\n\n[code moyatemplate]\n<!DOCTYPE html>\n<html>\n    <head>\n        <!-- renders content in the \"css\" section -->\n        {% block \"css\" %}{% render sections.css %}{% endblock %}\n        <!-- renders CSS paths added with the <include-css> tag -->\n        {% block \"includecss\" %}{% render include.css %}{% endblock %}\n        <!-- include JS that must go in the head -->\n        {% block \"jshead\" %}{% render sections.jshead %}{% endblock %}\n        <!-- render other head content -->\n        {% block \"head\" %}{% render sections.head %}{% endblock %}\n        <!-- set the title -->\n        <title>${title}</title>\n    </head>\n    <body>\n        <!-- render main body section -->\n        {% block \"body\" %}{% render sections.body %} {% endblock %}\n\n        <!-- generate script tags to from JS paths included with <include-js> -->\n        {% block \"includejs\" %}{% render include.js %}{% endif %}\n        <!-- render Javascript sections -->\n        {% block \"js\" %}{% render sections.js unique%}{% endblock %}\n        <!-- JS that must go at the bottom of the page -->\n        {% block \"jsfoot\" %}{% render sections.jsfoot unique%}{% endblock %}\n    </body>\n</html>\n[/code]\n\nThe common sections as as follows:\n\n[h2]\"css\"[/h2]\n\nThis block renders content from the [c]\"css\"[/c] section, such as html [c]<style>[/c] tags added by the [tag]css[/tag] tag. It is the head of the HTML.\n\n[h2]\"includecss\"[/h2]\n\nThis block renders the list of CSS paths added by the [tag]include-css[/tag] tag.\n\n[h2]\"jshead\"[/h2]\n\nThis block adds Javascript code that must be in the head of the HTML document. Note, that the [tag]js[/tag] tag adds to the [c]\"js\"[/c] section by default. If you want to add to the [c]\"jshead\"[/c] section, specify it with the [c]section[/c] attribute. For example:\n\n[code xml]\n<js section=\"jshead\">\n    alert(\"Ready for take-off!\");\n</js>\n[/code]\n\nThis would produce the following output in the [c]\"jshead\"[/c] block:\n\n[code moyatemplate]\n<script type=\"text/javascript\">\n    alert(\"Ready for take-off!\");\n</script>\n[/code]\n\nWhich would create an annoying popup when your page loads.\n\n[h2]\"head\"[/h2]\n\nThis block should contain any other markup that should appear in the head of the HTML.\n\n[h2]\"body\"[/h2]\n\nThis block renders the [c]body[/c] section which contains the main visible content. This is often overridden to create several content areas. For example, you could use the following template to divide the body in to separate content areas:\n\n[code moyatemplate]\n<!-- column-base.html -->\n{% extends \"base.html\" %}\n\n{% block \"body\" %}\n<div class=\"container\">\n    <div class=\"content\">\n        {% render sections.content %}\n    </div>\n    <div class=\"column\">\n        {% render sections.column %}\n    </div>\n</div>\n<div class=\"footer\">\n    {% render sections.footer %}\n</div>\n{% endblock %}\n[/code]\n\nBecause the above template [i]extends[/i] the base, it inherits the base template's blocks. It also adds three new sections that will render content. You can choose what content goes where in the content definition. Here's an example:\n\n[code xml]\n<content libname=\"content.article\" template=\"column-base.html\">\n    <section name=\"content\">\n        <sushi:article article=\"article\" />\n    </section>\n    <section name=\"column\">\n        <sushi:recent-articles />\n    </section>\n    <section name=\"footer\">\n        <text>Copyright 2014 Sushifinder PLC<text>\n    </section>\n</content>\n[/code]\n\n[h2]\"includejs\"[/h2]\n\nThis block renders the list of JS paths added by the [tag]include-js[/tag] tag. It is generally best to place this block at the end of the page, because it can delay page render time if the browser has to wait for external Javascript to load before it can render the page content.\n\n[h2]\"js\"[/h2]\n\nThis block renders JS added to the content with the [tag]js[/tag] tag. It is generally placed at the end of the page to speed up page render times -- but could equally be in the head of the page.\n\n[h2]\"jsfoot\"[/h2]\n\nThis block renders JS that should be included at the end of the page.\n\n[aside]If you are wondering why there are three javascript sections ([c]\"js\"[/c], [c]\"jshead\"[/c] and [c]\"jsfoot\"[/c]) -- it is so that the [c]\"js\"[/c] section can go whereever the template designer decides, but you still have the option of explicitly putting the Javascript in the head or the foot of the HTML document.",
        "name": "content",
        "docmap": [
            [
                1,
                "Defining Content"
            ],
            [
                1,
                "Rendering Content"
            ],
            [
                1,
                "Nested Content"
            ],
            [
                2,
                "Advanced Nesting"
            ],
            [
                1,
                "Content HTML tags"
            ],
            [
                1,
                "Extending Content"
            ],
            [
                1,
                "Widgets"
            ],
            [
                2,
                "Adding CSS to a widget"
            ],
            [
                2,
                "Adding Javascript to a Widget"
            ],
            [
                1,
                "Common Sections"
            ],
            [
                2,
                "\"css\""
            ],
            [
                2,
                "\"includecss\""
            ],
            [
                2,
                "\"jshead\""
            ],
            [
                2,
                "\"head\""
            ],
            [
                2,
                "\"body\""
            ],
            [
                2,
                "\"includejs\""
            ],
            [
                2,
                "\"js\""
            ],
            [
                2,
                "\"jsfoot\""
            ]
        ],
        "title": "Content"
    },
    "id": "doc.content"
}